Documents/ЛБ_ИнвентаризацияОтходовДМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_ИнвентаризацияОтходовДМ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЛБ_ДвижениеОтходов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПриказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтклонениеБулево</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчБрутто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчНетто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактБрутто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактНетто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтклБрутто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтклНетто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>МОЛы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИнвентаризационнаяКомиссия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Председатель</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дистанционно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЛБ_ТекущийЛомбардПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ТекущийЛомбардПользователя</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ЛБ_ДвижениеОтходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_ДвижениеОтходов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВесНетто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛомбардПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_КадроваяИсторияСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_КадроваяИсторияСотрудников</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыКадровыхСобытий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ДолжностиДляИнвентаризационнойКомиссии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ДолжностиДляИнвентаризационнойКомиссии</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыКадровыхСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыКадровыхСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Прием</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Увольнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачальныеДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВосстановлениеВДолжности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеподтвержденныеДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеОплатыТруда</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_ВидыСкладов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыСкладов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Залоги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Витрина</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтходыДМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Резерв</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщийСкладЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлеймениеМаркировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Экспертиза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УщербыЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УщербыВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВитринаЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВитринаОбщая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Торги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтходыДМЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтходыДМОбщий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Находки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мониторинг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реактивы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УчебныйЦентр</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ЛБ_Тара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЛБ_Тара</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Отделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОтделенияЛомбардов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесТары</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДейстующаяТара</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоПросмотр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ЛБ_ИнвентаризацияОтходовДМ/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Перем НеРедактировать Экспорт;

&НаКлиенте
Перем СтароеЗначение Экспорт;

&НаКлиенте
Перем НовоеЗначение Экспорт;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Дата = ТекущаяДата();
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Организация = Константы.ЛБ_ОсновнаяОрганизация.Получить();
		//Объект.Ответственный = Пользователи.ТекущийПользователь().Сотрудник;
		//ЛомбардСсылка = ПолучитьСсылкуЛомбарда();
		//Объект.Должность = Пользователи.ТекущийПользователь().Сотрудник.Должность;
		
		//Если ЗначениеЗаполнено(ЛомбардСсылка) Тогда
		Если ПараметрыСеанса.ТекущийПользователь.ЭтоЛомбард Тогда
			Объект.Должность = ПараметрыСеанса.ТекущийСотрудник.Должность;
			Объект.Ответственный = ПараметрыСеанса.ТекущийСотрудник;
			Объект.Ломбард = ПараметрыСеанса.ТекущийЛомбард; //ЛомбардСсылка;
		Иначе
			Объект.Должность = Пользователи.ТекущийПользователь().Сотрудник.Должность;
			Объект.Ответственный = Пользователи.ТекущийПользователь().Сотрудник;
			ЛомбардПользователя = РегистрыСведений.ЛБ_ТекущийЛомбардПользователя.Получить(Новый Структура("Пользователь", Пользователи.ТекущийПользователь()));
			Объект.Ломбард = ЛомбардПользователя.Ломбард;
		КонецЕсли;
		
		//+МАН 17.12.25
		ЗаполнитьСклады(Истина);
		//-МАН

		ДобавитьМОЛ();
		
		СтароеЗначение = Объект.Ломбард;
		
		ЗаполнитьУчетныеИфактическиеДанные();
		
		Модифицированность = Истина;
	КонецЕсли;

	Если ПараметрыСеанса.ТекущийПользователь.ЭтоЛомбард Тогда
		СотрудникЦО = Ложь;
	Иначе
		СотрудникЦО = Истина;
	КонецЕсли;
	
	ПроверитьНаличиеПредседателя();
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	ТекущаяДатаДокумента = Объект.Дата;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры  
   
&НаКлиенте
Процедура УстановитьВидимость()

	Если Объект.Проведен Тогда
		НеРедактировать = Истина;
		Элементы.ДекорацияСтатусДокумента.Заголовок = "Факт"; 
		Элементы.ДекорацияСтатусДокумента.ЦветТекста = WebЦвета.ТемноБордовый;  
		Элементы.ДекорацияСтатусДокумента.ЦветФона = WebЦвета.ТусклоРозовый;
		ЭтотОбъект.ТолькоПросмотр = НеРедактировать;
	Иначе
		НеРедактировать = Ложь;
		Элементы.ДекорацияСтатусДокумента.Заголовок = "Проект"; 
		Элементы.ДекорацияСтатусДокумента.ЦветТекста = WebЦвета.ТемноЗеленый;
		Элементы.ДекорацияСтатусДокумента.ЦветФона = WebЦвета.СветлоЗеленый;
		ЭтотОбъект.ТолькоПросмотр = НеРедактировать;
	КонецЕсли;

	//+МАН 17.12.25
	Если Элементы.Склад.СписокВыбора.Количество() > 1 Тогда
		Элементы.Склад.ТолькоПросмотр = Ложь;
	Иначе
		Элементы.Склад.ТолькоПросмотр = Истина;
	КонецЕсли;
	//-МАН
	
	Если СотрудникЦО Тогда
		Элементы.Ломбард.ТолькоПросмотр = Ложь;
	Иначе
		Элементы.Ломбард.ТолькоПросмотр = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСсылкуЛомбарда()
	Возврат ЛБ_ОбщийМодуль.ПолучитьСсылкуЛомбарда();
КонецФункции	

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьУчетныеИфактическиеДанные();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУчетныеИфактическиеДанные()
	
	ЗапросВесНетто = Новый Запрос;
	//+МАН 17.12.25 Изменил запрос
	//ЗапросВесНетто.Текст = 
	//	"ВЫБРАТЬ
	//	|	ЛБ_ДвижениеОтходовОстатки.ВесНеттоОстаток КАК ВесНеттоОстаток
	//	|ИЗ
	//	|	РегистрНакопления.ЛБ_ДвижениеОтходов.Остатки(
	//	|			&Дата,
	//	|			Организация = &Организация
	//	|				И Ломбард = &Ломбард) КАК ЛБ_ДвижениеОтходовОстатки";
	
	ЗапросВесНетто.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ДвижениеОтходовОстатки.ВесНеттоОстаток КАК ВесНеттоОстаток
		|ИЗ
		|	РегистрНакопления.ЛБ_ДвижениеОтходов.Остатки(
		|			&Дата,
		|			Организация = &Организация
		|				И Ломбард = &Ломбард
		|				И Склад = &Склад) КАК ЛБ_ДвижениеОтходовОстатки";
	//-МАН
	
	ЗапросВесНетто.УстановитьПараметр("Дата", НачалоДня(Объект.Дата));
	ЗапросВесНетто.УстановитьПараметр("Ломбард", Объект.Ломбард);
	ЗапросВесНетто.УстановитьПараметр("Организация", Объект.Организация);
	//+МАН 17.12.25
	ЗапросВесНетто.УстановитьПараметр("Склад", Объект.Склад);
	//-МАН
	
	РезультатВесНетто = ЗапросВесНетто.Выполнить().Выбрать();
	
	ВесТары = ПолучитьВесТары();
	
	Если РезультатВесНетто.Следующий() Тогда
		Объект.УчБрутто = РезультатВесНетто.ВесНеттоОстаток + ВесТары;
		Объект.УчНетто = РезультатВесНетто.ВесНеттоОстаток;
	КонецЕсли;
	
	Объект.ФактБрутто = Объект.УчБрутто;
	Объект.ФактНетто = Объект.УчНетто;
	
	РасчитатьОтклонения();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВесТары()
	ЗапросВесТары = Новый Запрос;
	ЗапросВесТары.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_Тара.Ссылка КАК Ссылка,
		|	ЛБ_Тара.ДейстующаяТара КАК ДейстующаяТара
		|ИЗ
		|	Справочник.ЛБ_Тара КАК ЛБ_Тара
		|ГДЕ
		|	ЛБ_Тара.Ломбард = &Ломбард
		|	И ЛБ_Тара.ДейстующаяТара = ИСТИНА";
	
	ЗапросВесТары.УстановитьПараметр("Ломбард", Объект.Ломбард);
	
	РезультатВесТары = ЗапросВесТары.Выполнить().Выбрать();
	
	ВесТары = 0;
	
	Если РезультатВесТары.Следующий() Тогда
		Если РезультатВесТары.ДейстующаяТара Тогда
			ВесТары = РезультатВесТары.Ссылка.ВесТары;
		КонецЕсли;
	КонецЕсли;

	Возврат ВесТары;

КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.ОтклБрутто <> 0 ИЛИ Объект.ОтклНетто <> 0 Тогда
		Объект.ОтклонениеБулево = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Тип) Тогда
		Объект.Тип = "Инвентаризация";
	КонецЕсли;
	
	Если ПараметрыЗаписи.РежимЗаписи = ПредопределенноеЗначение("РежимЗаписиДокумента.Проведение") Тогда
		
		ВсеЗаполнено = ПроверитьЗаполнениеТЧ();
		Если НЕ ВсеЗаполнено Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Ответ = Вопрос("После проведения документа, отмена изменений будет невозможна.
						|Провести документ?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Отказ = Ложь;
		Иначе
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПечататьАкт(Команда)
	Если Объект.Проведен Тогда 
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ИменаМакетов", "АктОтходовДМ"); 
		ПараметрыФормы.Вставить("ИмяМенеджераПечати", "Документ.ЛБ_ИнвентаризацияОтходовДМ");
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(Объект.Ссылка);
		ПараметрыФормы.Вставить("ПараметрКоманды", МассивОбъектов);
		ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыФормы, ЭтаФорма,,,,,);   
	Иначе
		Предупреждение("Перед печатью необходимо провести документ!");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьЗаполнениеТЧ()
	
	//ЕстьПредседатель = Объект.ИнвентаризационнаяКомиссия.НайтиСтроки(Новый Структура("Председатель", Истина));
	
	Если Объект.МОЛы.Количество() = 0 Тогда
		Предупреждение("Не заполнены МОЛ. Проведение документа запрещено!");
		Возврат Ложь;
	ИначеЕсли Объект.ИнвентаризационнаяКомиссия.Количество() = 0 Тогда
		Предупреждение("Не заполнены члены комиссии. Проведение документа запрещено!");
		Возврат Ложь;
	//ИначеЕсли ЕстьПредседатель.Количество() = 0 Тогда
	ИначеЕсли НЕ ЕстьПредседатель Тогда
		Предупреждение("Не выбран председатель комиссии. Проведение документа запрещено!");
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ДатаПриказаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Если Элемент.ТекстРедактирования > Строка(Формат(Объект.Дата, "ДФ=dd.MM.yyyy")) Тогда
		Предупреждение("Дата приказа не может быть больше даты документа!");
		Объект.ДатаПриказа = Дата(1,1,1);
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриказаОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	Если ВыбранноеЗначение > Объект.Дата Тогда
		Предупреждение("Дата приказа не может быть больше даты документа!");
		ВыбранноеЗначение = Дата(1,1,1);
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_Инвентаризация.Ссылка КАК Ссылка,
		|	ЛБ_Инвентаризация.ИнвентаризационнаяКомиссия.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		ФизЛицо КАК ФизЛицо,
		|		Председатель КАК Председатель,
		|		Дистанционно КАК Дистанционно,
		|		Должность КАК Должность
		|	) КАК ИнвентаризационнаяКомиссия,
		|	ЛБ_Инвентаризация.МОЛы.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		ФизЛицо КАК ФизЛицо,
		|		Должность КАК Должность
		|	) КАК МОЛы
		|ИЗ
		|	Документ.ЛБ_Инвентаризация КАК ЛБ_Инвентаризация
		|ГДЕ
		|	НЕ ЛБ_Инвентаризация.ПометкаУдаления
		|	И ЛБ_Инвентаризация.Ломбард = &Ломбард
		|	И ЛБ_Инвентаризация.Дата МЕЖДУ &ДатаНач И &ДатаКон";
	
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ДатаКон", ТекущаяДата());
	Запрос.УстановитьПараметр("Ломбард", Объект.Ломбард);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Объект.ИнвентаризационнаяКомиссия.Загрузить(Результат.ИнвентаризационнаяКомиссия.Выгрузить());
		Объект.МОЛы.Загрузить(Результат.МОЛы.Выгрузить());
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьМОЛ()
	
	Если ПараметрыСеанса.ТекущийПользователь.ЭтоЛомбард Тогда
		Сотр = ПараметрыСеанса.ТекущийСотрудник;
	Иначе
		Сотр = Пользователи.ТекущийПользователь().Сотрудник;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("ФизЛицо", Сотр); // Пользователи.ТекущийПользователь().Сотрудник);
	
	ЕстьСотрудник = Объект.МОЛы.НайтиСтроки(Отбор);
	Если ЕстьСотрудник.Количество() = 0 Тогда
		СтрМОЛы = Объект.МОЛы.Добавить();
		СтрМОЛы.ФизЛицо = Сотр;
		СтрМОЛы.Должность = Сотр.Должность;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСотрудниковМОЛ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрСведений.ЛБ_КадроваяИсторияСотрудников.СрезПоследних(
		|			&Дата,
		|			Подразделение В
		|				(ВЫБРАТЬ
		|					ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард КАК Ломбард
		|				ИЗ
		|					РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&Дата, Отделение В
		|						(ВЫБРАТЬ
		|							ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение КАК Отделение
		|						ИЗ
		|							РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&Дата, Ломбард = &Ломбард) КАК ЛБ_ОтделенияЛомбардовСрезПоследних)) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
		|				ГДЕ
		|					НЕ ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард.Закрыт)) КАК ЛБ_КадроваяИсторияСотрудниковСрезПоследних
		|ГДЕ
		|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыКадровыхСобытий.Увольнение)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Сотрудник.Наименование";
	
	Запрос.УстановитьПараметр("Дата", ?(Объект.Дата = Дата(1,1,1), ТекущаяДата(), НачалоДня(Объект.Дата)));
	Запрос.УстановитьПараметр("Ломбард", Объект.Ломбард);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	МассивВозврата = Новый Массив;
	
	Для каждого Стр Из Результат Цикл
		МассивВозврата.Добавить(Стр.Сотрудник);
	КонецЦикла;
	
	Возврат МассивВозврата;
	
КонецФункции

&НаКлиенте
Процедура МОЛыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Объект.МОЛы.Количество() = 3 Тогда
		Предупреждение("Достигнуто максимально допустимое количество материально ответственных лиц.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораСотрудникаМОЛ", ЭтаФорма);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("МассивСотрудников", ПолучитьСотрудниковМОЛ());
	
	ОткрытьФорму("Справочник.ЛБ_Сотрудники.Форма.ФормаВыбораСотрудников",ПараметрыФормы,,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораСотрудникаМОЛ(Результат, ДопПараметры) Экспорт
	
	Отбор = Новый Структура;
	
	Если Результат <> Неопределено Тогда
		Отбор.Вставить("ФизЛицо", Результат);
		
		НайденныеСтроки = Объект.МОЛы.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			Сообщить("Сотрудник уже выбран.");
			
			Отбор.Вставить("ФизЛицо", Справочники.ЛБ_Сотрудники.ПустаяСсылка());
			
			НайденныеСтроки = Объект.МОЛы.НайтиСтроки(Отбор);
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				
				СтрокаДокумента = НайденныеСтроки[НайденныеСтроки.ВГраница()];
				
				ИндексСтр = Объект.МОЛы.Индекс(СтрокаДокумента);;
				Объект.МОЛы.Удалить(ИндексСтр);
				Возврат;
			КонецЕсли;
		КонецЕсли;			
	КонецЕсли;
	
	Отбор.Вставить("ФизЛицо", Справочники.ЛБ_Сотрудники.ПустаяСсылка());
	
	НайденныеСтроки = Объект.МОЛы.НайтиСтроки(Отбор);

	Если НайденныеСтроки.Количество() > 0 Тогда
		
		СтрокаДокумента = НайденныеСтроки[НайденныеСтроки.ВГраница()];
		
		Если Результат = Неопределено Тогда
			ИндексСтр = Объект.МОЛы.Индекс(СтрокаДокумента);;
			Объект.МОЛы.Удалить(ИндексСтр);
			Возврат;
		КонецЕсли;
		
		СтрокаДокумента.ФизЛицо = Результат;
		СтрокаДокумента.Должность = Результат.Должность;
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнвентаризационнаяКомиссияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Объект.ИнвентаризационнаяКомиссия.Количество() = 4 Тогда
		Предупреждение("Достигнуто максимально допустимое количество членов инвентаризационной комиссии.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораСотрудникаИК", ЭтаФорма);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("МассивСотрудников", ПолучитьСотрудниковИК());
	
	ОткрытьФорму("Справочник.ЛБ_Сотрудники.Форма.ФормаВыбораСотрудников",ПараметрыФормы,,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораСотрудникаИК(Результат, ДопПараметры) Экспорт
	
	Отбор = Новый Структура;
	
	Если Результат <> Неопределено Тогда
		Отбор.Вставить("ФизЛицо", Результат);
		
		НайденныеСтроки = Объект.ИнвентаризационнаяКомиссия.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			Сообщить("Сотрудник уже выбран.");
			
			Отбор.Вставить("ФизЛицо", Справочники.ЛБ_Сотрудники.ПустаяСсылка());
			
			НайденныеСтроки = Объект.ИнвентаризационнаяКомиссия.НайтиСтроки(Отбор);
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				
				СтрокаДокумента = НайденныеСтроки[НайденныеСтроки.ВГраница()];
				
				ИндексСтр = Объект.ИнвентаризационнаяКомиссия.Индекс(СтрокаДокумента);;
				Объект.ИнвентаризационнаяКомиссия.Удалить(ИндексСтр);
				Возврат;
			КонецЕсли;
		КонецЕсли;			
	КонецЕсли;
	
	Отбор.Вставить("ФизЛицо", Справочники.ЛБ_Сотрудники.ПустаяСсылка());
	
	НайденныеСтроки = Объект.ИнвентаризационнаяКомиссия.НайтиСтроки(Отбор);

	Если НайденныеСтроки.Количество() > 0 Тогда
		
		СтрокаДокумента = НайденныеСтроки[НайденныеСтроки.ВГраница()];
		
		Если Результат = Неопределено Тогда
			ИндексСтр = Объект.ИнвентаризационнаяКомиссия.Индекс(СтрокаДокумента);;
			Объект.ИнвентаризационнаяКомиссия.Удалить(ИндексСтр);
			Возврат;
		КонецЕсли;
		
		СтрокаДокумента.ФизЛицо = Результат;
		СтрокаДокумента.Должность = Результат.Должность;
	КонецЕсли;

	Модифицированность = Истина;

КонецПроцедуры

&НаСервере
Функция ПолучитьСотрудниковИК()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
		|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность КАК Должность
		|ИЗ
		|	РегистрСведений.ЛБ_КадроваяИсторияСотрудников.СрезПоследних(
		|			&Дата,
		|			ВЫБОР
		|				КОГДА Подразделение = ЗНАЧЕНИЕ(Справочник.ЛБ_Ломбарды.ПустаяСсылка)
		|					ТОГДА ИСТИНА
		|				КОГДА Подразделение В
		|						(ВЫБРАТЬ
		|							ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард КАК Ломбард
		|						ИЗ
		|							РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&Дата, Отделение В
		|								(ВЫБРАТЬ
		|									ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение КАК Отделение
		|								ИЗ
		|									РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&Дата, Ломбард = &Ломбард) КАК ЛБ_ОтделенияЛомбардовСрезПоследних)) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
		|						ГДЕ
		|							НЕ ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард.Закрыт)
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ) КАК ЛБ_КадроваяИсторияСотрудниковСрезПоследних
		|ГДЕ
		|	НЕ ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность В
		|				(ВЫБРАТЬ
		|					ЛБ_ДолжностиДляИнвентаризационнойКомиссии.Должность КАК Должность
		|				ИЗ
		|					РегистрСведений.ЛБ_ДолжностиДляИнвентаризационнойКомиссии КАК ЛБ_ДолжностиДляИнвентаризационнойКомиссии)
		|	И ЛБ_КадроваяИсторияСотрудниковСрезПоследних.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыКадровыхСобытий.Увольнение)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Сотрудник.Наименование";
	
	Запрос.УстановитьПараметр("Дата", ?(Объект.Дата = Дата(1,1,1), ТекущаяДата(), НачалоДня(Объект.Дата)));
	Запрос.УстановитьПараметр("Ломбард", Объект.Ломбард);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	МассивВозврата = Новый Массив;
	
	Пока Результат.Следующий() Цикл
		МассивВозврата.Добавить(Результат.Сотрудник);
	КонецЦикла;
	
	Возврат МассивВозврата;
	
КонецФункции

&НаКлиенте
Процедура ПечатьПустойАкт(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИменаМакетов", "ПустойАкт"); 
	ПараметрыФормы.Вставить("ИмяМенеджераПечати", "Документ.ЛБ_ИнвентаризацияОтходовДМ");
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Объект.Ссылка); //ПредопределенноеЗначение("Документ.ЛБ_ИнвентаризацияОтходовДМ.ПустаяСсылка"));
	ПараметрыФормы.Вставить("ПараметрКоманды", МассивОбъектов);
	ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыФормы, ЭтаФорма,,,,,);   
КонецПроцедуры

&НаКлиенте
Процедура ФактБруттоПриИзменении(Элемент)
	ВесТары = ПолучитьВесТары();
	
	Объект.ФактНетто = Объект.ФактБрутто - ВесТары;
	
	РасчитатьОтклонения();
	
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ФактНеттоПриИзменении(Элемент)
	ВесТары = ПолучитьВесТары();
	
	Объект.ФактБрутто = Объект.ФактНетто + ВесТары;
	
	РасчитатьОтклонения();
	
	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура РасчитатьОтклонения()
	Объект.ОтклБрутто = Объект.ФактБрутто - Объект.УчБрутто;
	Объект.ОтклНетто = Объект.ФактНетто - Объект.УчНетто;
КонецПроцедуры

&НаКлиенте
Процедура ЛомбардОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	Если Объект.Ломбард <> ВыбранноеЗначение Тогда
		Если (Объект.УчБрутто <> 0 И Объект.ФактБрутто <> 0)
			ИЛИ (Объект.УчНетто <> 0 И Объект.ФактНетто <> 0) Тогда
			
			Ответ = Вопрос("При изменении ломбарда очистятся учетные и фактические данные.
			|Изменить ломбард?", РежимДиалогаВопрос.ДаНет);
			
			Если Ответ = КодВозвратаДиалога.Да Тогда
				Объект.УчБрутто = 0;
				Объект.УчНетто = 0;
				Объект.ФактБрутто = 0;
				Объект.ФактНетто = 0;
				Объект.ОтклБрутто = 0;
				Объект.ОтклНетто = 0;
				
				СтароеЗначение = Объект.Ломбард;
				НовоеЗначение = ВыбранноеЗначение;
				
				Модифицированность = Истина;
			Иначе
				СтандартнаяОбработка = Ложь;
				
				Объект.Ломбард = Объект.Ломбард;
				
				Возврат;
			КонецЕсли;
		Иначе
			СтароеЗначение = Объект.Ломбард;
			НовоеЗначение = ВыбранноеЗначение;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЛомбардПриИзменении(Элемент)
	Если СтароеЗначение <> НовоеЗначение Тогда
		//+МАН 17.12.25
		ЗаполнитьСклады(Истина);
		УстановитьВидимость();
		//-МАН
		ЗаполнитьУчетныеИфактическиеДанные();
		СтароеЗначение = НовоеЗначение;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИнвентаризационнаяКомиссияПредседательПриИзменении(Элемент)
	Если НЕ ЕстьПредседатель Тогда
		ЕстьПредседатель = Истина;
	ИначеЕсли НЕ Элементы.ИнвентаризационнаяКомиссия.ТекущиеДанные.Председатель	И ЕстьПредседатель Тогда
		ЕстьПредседатель = Ложь;
	Иначе
		Предупреждение("Председатель комиссии уже выбран.");
		Элементы.ИнвентаризационнаяКомиссия.ТекущиеДанные.Председатель = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаличиеПредседателя()
	Отбор = Новый Структура;
	Отбор.Вставить("Председатель", Истина);
	
	МассивПредседатель = Объект.ИнвентаризационнаяКомиссия.НайтиСтроки(Отбор);
	
	Если МассивПредседатель.Количество() >= 1 Тогда
		ЕстьПредседатель = Истина;
	Иначе
		ЕстьПредседатель = Ложь;
	КонецЕсли;
КонецПроцедуры

//+МАН 17.12.25
&НаСервере
Функция ЗаполнитьСписокВыбораСкладов(Ломбард)

	МассивСкладов = Новый Массив;
	
	Если ЗначениеЗаполнено(Ломбард) И ТипЗнч(Ломбард) = Тип("СправочникСсылка.ЛБ_Ломбарды") Тогда
		Запрос = новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_Склады.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.ЛБ_Склады КАК ЛБ_Склады
		               |ГДЕ
		               |	ЛБ_Склады.Владелец = &Владелец
		               |	И (ЛБ_Склады.ВидСклада = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыСкладов.ОтходыДМ)
		               |			ИЛИ ЛБ_Склады.ВидСклада = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыСкладов.ОтходыДМЦО)
		               |			ИЛИ ЛБ_Склады.ВидСклада = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыСкладов.ОтходыДМОбщий))";
		Запрос.УстановитьПараметр("Владелец", Ломбард);

		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			МассивСкладов.Добавить(Выборка.Ссылка);
		Конеццикла;
	КонецЕсли;
	
	Возврат МассивСкладов;
КонецФункции

&НаСервере
Процедура ЗаполнитьСклады(НовыйДокумент = Ложь)
	Если ЗначениеЗаполнено(Объект.Ломбард) Тогда
		Склады = ЗаполнитьСписокВыбораСкладов(Объект.Ломбард);
		
		Если Склады.Количество() > 1 Тогда
			Элементы.Склад.СписокВыбора.Очистить();
			Элементы.Склад.СписокВыбора.ЗагрузитьЗначения(Склады);
		ИначеЕсли Склады.Количество() = 1 Тогда
			Элементы.Склад.СписокВыбора.Очистить();
			Элементы.Склад.СписокВыбора.Добавить(Склады[0]);
			
			Если НовыйДокумент Тогда
				Объект.Склад = Склады[0];
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	ЗаполнитьУчетныеИфактическиеДанные();
КонецПроцедуры
//-МАН
